package com.example.binary;

public class TestMain {


    /**
     * 完全二叉树（Complete Binary Tree）—— 🌟 重点中的重点
     * 特点：
     * 除了最后一层，其他层的节点数都达到最大。
     * 最后一层的节点必须从左到右连续排列，中间不能有空缺。
     * 长相：可以把它想象成一棵“满二叉树”被从右下角抠掉了几块。
     * 为什么重要？ 因为完全二叉树可以用数组来完美存储（见下文），它是实现优先队列（堆 Heap） 的基础
     *
     * . 数组存储（完全二叉树的“奇技淫巧”）
     * 如果一棵树是完全二叉树，我们可以把它按层序塞进一个数组里。
     * 假设根节点在数组的下标为 i（从 0 开始）：
     * 左孩子的下标永远是：2 * i + 1
     * 右孩子的下标永远是：2 * i + 2
     * 父节点的下标永远是：(i - 1) / 2 （向下取整）
     * 优点：不需要指针，节省内存，访问速度极快（堆排序、优先队列的底层原理）
     *
     *
     *         A(0)
     *        /     \
     *     B(1)      C(2)
     *     /  \      /  \
     *   D(3) E(4) F(5) G(6)
     *   /
     * H(7)
     *
     *          数组下标： 0    1    2    3    4    5    6    7
     * String[] tree = {"A", "B", "C", "D", "E", "F", "G", "H"};
     * 假设i =2  C
     * 左：2*2+1=5 F
     * 右：2*2+2=6 G
     * 父：（2-1）/2=0 A
     *
     * 0，1，2，3，4，5
     *
     *
     *
     * 二叉树遍历
     * 1. 深度优先遍历（DFS - Depth First Search）
     *       A
     *      / \
     *     B   C
     *    / \
     *   D   E
     *
     * 前序遍历（根 -> 左 -> 右）：先访问根，再左子树，再右子树。
     * 结果：A -> B -> D -> E -> C
     *
     * 中序遍历（左 -> 根 -> 右）：先左子树，再根，再右子树。
     * 结果：D -> B -> E -> A -> C
     *
     * 后序遍历（左 -> 右 -> 根）：先左子树，再右子树，最后根。
     * 结果：D -> E -> B -> C -> A
     *
     * 在未来的“二叉查找树”中，中序遍历的结果将是一个从小到大排好序的序列，这是它最核心的特性！
     *
     * 2. 广度优先遍历（BFS - Breadth First Search）
     * 也叫层序遍历。像水波纹一样，一层一层地访问。
     * 结果：A -> B -> C -> D -> E
     * 实现方法：通常需要借助队列（Queue） 来实现。
     */




    public static void main(String[] args) {

    }
}
